scc2425-tukano/src/main/test/artillery/first_get.yaml
config:
    target: https://project1scc24256018360431.azurewebsites.net/rest/
    phases:
        - name: simple_get
          duration: 1 # how long the test will run for, in seconds
          arrivalRate: 1 # number of arrivals per second.

scenarios:
    - name: TuKanoHome
      flow:
        - get:
            url: /users/kgallagher?pwd=easypass