scc2425-tukano/src/main/test/artillery/first_post.yaml
config:
    target: https://project1scc24256018360431.azurewebsites.net/rest/
    phases:
        - name: simple_post
          duration: 1
          arrivalRate: 3
    payload:
        path: ./data/users.csv
        order: sequence # selects users sequentially, default is random
        loadAll: true # load the whole CSV
        skipHeader: true # The first line is a header, so we want to skip it
        delimiter: "," # standard delimiter
        skipEmptyLines: true # not important in our case
        fields:
            - "id"
            - "pwd"
            - "email"
            - "displayName"
scenarios:
    - name: TuKanoRegister
      flow:
        - post:
            url: /users/
            headers:
                Content-Type: application/json
            json:
                id: "{{ id }}" # this parameter is filled from the fields above
                pwd: "{{ pwd }}"
                email: "{{ email }}"
                displayName: "{{ displayName }}"